In [1]:
import pandas as pd
df = pd.read_csv("employee.csv")
df.head(2)

   ID FirstName  LastName Gender   Salary Location
0   1       Ben   Hoskins   Male  70000.0    Delhi
1   2      Mark  Hastings   Male  60000.0   Mumbai

#### df.df['column_name'].astype('int')
##### Changes the type of data in a column.

In [4]:
df.dtypes

ID             int64
FirstName     object
LastName      object
Gender        object
Salary       float64
Location      object
dtype: object

In [15]:
print(df['ID'].dtype)
print(df['ID'].astype('str').dtype)

int64
object